### Books (Core)
- Paula Pipkin

In [45]:
import pandas as pd
import numpy as np

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

connection_str = "mysql+pymysql://root:root@localhost/books_db_core"

Â ![png](erd_book.png)

In [46]:
engine = create_engine(connection_str)
engine

Engine(mysql+pymysql://root:***@localhost/books_db_core)

In [47]:
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

In [48]:
users = pd.read_csv('data/data (1).csv')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [49]:
users.to_sql('users', engine, if_exists = 'replace')
q = """SELECT * FROM users LIMIT 5;"""
pd.read_sql(q, engine)

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

In [50]:
books = pd.read_csv('data/data (2).csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [51]:
books.to_sql('books', engine, if_exists = 'replace')
q = """SELECT * FROM books LIMIT 5;"""
pd.read_sql(q, engine)

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4

In [52]:
authors = pd.read_csv('data/data (3).csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [53]:
authors.to_sql('authors', engine, if_exists = 'replace')
q = """SELECT * FROM authors LIMIT 5;"""
pd.read_sql(q, engine)

   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

In [54]:
favorits = pd.read_csv('data/data (4).csv')
favorits.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [55]:
favorits.to_sql('favorits', engine, if_exists = 'replace')
q = """SELECT * FROM favorits LIMIT 5;"""
pd.read_sql(q, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5

In [56]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books_db_core
0                 authors
1                   books
2                favorits
3                   users

#### Test: List the titles of all of John Doe's favorite books

In [57]:
q = """SELECT books.title, favorits.user_id
FROM books
JOIN favorits ON books.id = favorits.book_id
WHERE favorits.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(q,engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1